class Shcool:
    def __init__(self, ):
        self.fio
        pass


class Student:
    def __init__(self, surname, name, middle_name, date_of_birth, classroom, mama, papa):
        self.surname = surname
        self.name = name
        self.middle_name = middle_name
        self.date = date_of_birth
        self.classroom = classroom
        self.mama = mama
        self.papa = papa
        # self.fio_st = surname + ' ' + name[0] + '. ' + middle_name[0] + '.'

    def fio(self):
        self.fio_st = self.surname + ' ' + self.name[0] + '. ' + self.middle_name[0] + '.'
        print(self.fio_st)
        a = []
        for i in students:
            print(i)
            if i == self.fio_st:
                a.append(i)
                return a

students = [Student('Иванов', 'Иван', 'Иванович', '20.02.2003', '5 А', 'Иванова Зинаида Петровна',
                    'Иванов Иван Петрович'),
            Student('Забулдыгин', 'Фёдор', 'Павлович', '14.01.2004', '5 А', 'Забулдыгина Вера Аристарховна',
                    'Забулдыгин Павел Валерьевич'),
            Student('Пипеткина', 'Ксения', 'Александровна', '25.07.2003', '6 А', 'Пипеткина Галина Павловна',
                    'Пипеткин Александр Валентинович'),
            Student('Верещагин', 'Дмитрий', 'Алексеевич', '01.01.2003', '6 А', 'Верещагина Наталья Андреевна',
                    'Верещагин Алексей Петрович'),
            Student('Антонов', 'Анатолий', 'Аникеевич', '17.10.2003', '8 А', 'Антонова Галина Владимировна',
                    'Антонов Аникей Львович'),
            Student('Москвин', 'Владимир', 'Анатольевич', '05.01.2002', '7 А', 'Москвина Вероника Антоновна',
                    'Москвин Анатолий Сергеевич'),
            Student('Рожкова', 'Инна', 'Александровна', '01.01.2002', '9 А', 'Рожкова Анастасия Артуровна',
                    'Рожков Александр Александрович'),
            Student('Лисина', 'Анжела', 'Ивановна', '30.12.2002', '10 А', 'Лисина Нелля Вадимовна',
                    'Лисин Иван Каримович'),
            ]
#
# teachers = [MyTeacher('Пермякова', 'Валентина', 'Петровна', 'Математика', '5 А', '6 A', '8 А', '9 А'),
#             MyTeacher('Петров', 'Пётр', 'Андреевич', 'Русский язык', '5 А', '10 А'),
#             MyTeacher('Языкова', 'Тамара', 'Павловна', 'Литература', '5 А', '7 A', '9 А'),
#             MyTeacher('Форсункина', 'Аврора', 'Генадьевна', 'Алгебра', '6 A', '8 А'),
#             MyTeacher('Черпаков', 'Валерий', 'Петрович', 'ОБЖ', '7 A', '8 А'),
#             MyTeacher('Данилин', 'Роберт', 'Владиславович', 'Физ-ра', '7 A', '10 А')
#             ]
